``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.sn07-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "sn07-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_sn07.galaxyproject.eu_A"
        name            = "sn07.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.237",
          + "132.230.223.238",
        ]
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.ryan will be created
  + resource "openstack_compute_instance_v2" "ryan" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c36m100"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "student-ryan-vm"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
        ]
      + stop_before_destroy = false
      + user_data           = "d6205a4216beffd96641f38aa9bb71c1de310a8e"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 500
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```